---
kind: type
id: T:Autodesk.Revit.DB.BoundaryValidation
source: html/82d6e0c5-f102-ce90-9521-3c2e74fbd495.htm
---
# Autodesk.Revit.DB.BoundaryValidation

Curve loop validators.

## Syntax (C#)
```csharp
public class BoundaryValidation : IDisposable
```